Repository: julia-morg/numerocide
Catalog: assets/l10n/app_*.arb
Languages: ru

# appTitle
source: Numerocide
ru: Нумероцид

# languageName
source: English
ru: Русский

# homePageNewGame
source: NEW GAME
ru: НОВАЯ ИГРА

# homePageContinueGame
source: CONTINUE GAME
ru: ПРОДОЛЖИТЬ ИГРУ

# homePageBestResult
source: BEST RESULT
ru: ЛУЧШИЙ РЕЗУЛЬТАТ

# homePageStage
source: Stage
ru: Уровень

# homePageBestScore
source: Best
ru: Лучший

# homePageSavedGamePopupTitle
source: You have a saved game
ru: У вас есть сохранённая игра

# homePageSavedGamePopupText
source: Are you sure you want to start a new game? Your current progress will be lost.
ru: Вы уверены, что хотите начать новую игру? Ваш текущий прогресс будет утерян.

# homePageSavedGamePopupCancel
source: BACK
ru: НАЗАД

# homePageSavedGamePopupConfirm
source: NEW GAME
ru: НОВАЯ ИГРА

# suggestTutorialPopupTitle
source: How to play
ru: Как играть

# suggestTutorialPopupText
source: It seems you’re here for the first time. Would you like to learn the game rules?
ru: Кажется, вы тут впервые. Хотите узнать правила игры?

# suggestTutorialPopupConfirm
source: TUTORIAL
ru: ДА, ОБУЧЕНИЕ

# suggestTutorialPopupCancel
source: GO TO GAME
ru: НЕТ, К ИГРЕ

# suggestTutorialPopupOnCancel
source: The rules are always available in the settings menu.
ru: Правила всегда доступны в меню настроек.

# gamePageStage
source: Stage
ru: Уровень

# gamePageBest
source: Best
ru: Лучший

# gamePageGameOverPopupTitle
source: GAME OVER
ru: ИГРА ОКОНЧЕНА

# gamePageGameOverPopupBest
source: This is your best score ever!
ru: Это ваш лучший результат за всё время!

# gamePageGameOverPopupScore
source: No more moves! SCORE:
ru: Ходов больше нет СЧЁТ:

# gamePageGameOverPopupConfirm
source: RETURN
ru: ВЕРНУТЬСЯ

# settingsPageHeader
source: Settings
ru: Настройки

# settingsPageSound
source: Sound
ru: Звук

# settingsPageVibro
source: Vibration
ru: Вибрация

# settingsPageLang
source: Language
ru: Язык

# settingsPageTheme
source: Theme
ru: Тема

# settingsPageInfo
source: Info
ru: Информация

# settingsPagePrivacyPolicy
source: Privacy Policy
ru: Политика конфиденциальности

# settingsPageTermsOfService
source: Terms of Service
ru: Условия обслуживания

# settingsPageThemeNavy
source: Navy
ru: Морская

# settingsPageThemeCocoa
source: Cocoa
ru: Какао

# settingsPageThemeStone
source: Stone
ru: Каменная

# settingsPageThemeGrass
source: Grass
ru: Травяная

# donatePageHeader
source: Donate
ru: Поддержать

# donatePageText
source: This game contains no advertisements and is available for free. If you would like to support the developer, here are the available donation options:
ru: В этой игре нет рекламы, и она доступна бесплатно. Если вы хотите поддержать разработчика, вот доступные варианты пожертвований:

# donatePageOption
source: Donate
ru: Пожертвовать

# donatePagePopupTitle
source: Confirm donation
ru: Подтвердите пожертвование

# donatePagePopupText
source: You are about to donate
ru: Вы жертвуете

# donatePagePopupNote
source: This action cannot be undone. Do you want to proceed?
ru: Это действие нельзя отменить. Вы хотите продолжить?

# donatePagePopupCancel
source: Cancel
ru: Отмена

# donatePagePopupConfirm
source: Confirm
ru: Подтвердить

# donatePageThanks
source: Thank you for donating ${amount}!
ru: Спасибо за пожертвование ${amount}!

# donatePageFail
source: Failed to process donation
ru: Не удалось обработать пожертвование

# tutorialPageHeader
source: How to play
ru: Как играть

# tutorialPageNextStep
source: Next Step
ru: Следующий шаг

# tutorialPageGotoMenu
source: Got it! To Main Menu
ru: Понял! В главное меню

# tutorialPagePopupTitle
source: Hooraay
ru: Ура!

# tutorialPagePopupText
source: The tutorial is completed and you are ready to play the game!
ru: Обучение завершено, и вы готовы начать игру!

# tutorialPagePopupRestart
source: Restart
ru: Начать заново

# tutorialPagePopupFinish
source: Main Menu
ru: Главное меню

# tutorialPageStep1
source: You can remove cells with numbers that are equal or add up to 10 if they are adjacent to each other
ru: Удаляй соседние клетки с числами, которые равны или в сумме дают 10

# tutorialPageStep2
source: … or are located one above the other
ru: Удаляй клетки с числами, которые равны или в сумме дают 10, если они друг над другом

# tutorialPageStep3
source: Even if there was a line break between the cells, but they are adjacent, you can still remove them
ru: Перенос строки не имеет значения, подходящие клетки все равно можно удалить

# tutorialPageStep4
source: If the cells are diagonal to each other, you can also remove them
ru: Если клетки находятся на одной диагонали и соответствуют условиям, их можно удалить

# tutorialPageStep5
source: The direction of the diagonal doesn’t matter
ru: Направление диагонали не имеет значения, если клетки подходят по правилам

# tutorialPageStep6
source: This is true for any diagonals, as long as there are no active cells on them
ru: Если на диагонали нет активных клеток, можно удалять более далекие клетки

# tutorialPageStep7
source: You can also remove the first and last cells on a desk
ru: Можно удалить первую и последнюю клетки на поле, если они подходят по правилам

# tutorialPageStep8
source: If you remove all the cells in a row, the row is destroyed
ru: Если удалены все клетки в строке, строка уничтожается, все клетки ниже сместятся

# tutorialPageStep9
source: If you clear the entire board, you advance to the next level
ru: Если очистить все поле, ты перейдешь на следующий уровень

# testPageHeader
source: Test
ru: Тест
